Revit 2024 API
ExportColumnHeaders Enumeration
 Options for exporting column headers in schedule view export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum ExportColumnHeaders
Visual Basic
Public Enumeration ExportColumnHeaders
Visual C++
public enum class ExportColumnHeaders
Members
Member name | Description
None |  Do not export column headers.
OneRow |  Export the column headers only.
MultipleRows |  Both column headers and grouped header cells are exported.
See Also
Autodesk.Revit.DB Namespace